ERP DEV.WMS/src/InformationRegisters/вмс_ШтрихкодыРасширенный/вмс_ШтрихкодыРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ШтрихкодыРасширенный</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ЛицензииПодсистем/вмс_ЛицензииПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЛицензииПодсистем</name>
  <resources>
    <name>Отображение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_РаспоряженияОпераций/вмс_РаспоряженияОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_РаспоряженияОпераций</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениеКонфигуратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДТовары</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияДляПросмотраРезультата</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_ОбновлениеИнформационнойБазыWMS/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Функция Имя() Экспорт
	
	Возврат "WMS";
	
КонецФункции

// Функция - Версия
// Возвращает версию модуля. 
//
// Возвращаемое значение:
//   Строка - версия модуля.
//
Функция Версия() Экспорт
	
	РасширениеКонфигурации = РасширениеКонфигурации();
	
	Если РасширениеКонфигурации <> Неопределено Тогда
		Возврат РасширениеКонфигурации.Версия;
	КонецЕсли;
	
	//Возврат "1.0.0.4";
	
КонецФункции

// проверяет изменено ли расширение после запуска сеанса
//
// Возвращаемое значение:
//   Булево - Истина, если хеш-сумма расширения конфигурации изменилась.
//
Функция РасширениеКонфигурацииИзменено() Экспорт
	
	Возврат ПараметрыСеанса.вмс_ХешСуммаРасширенияКонфигурации <> ХешСуммаРасширенияКонфигурации();
	
КонецФункции

Функция ХешСуммаРасширенияКонфигурации() Экспорт
	
	РасширениеКонфигурации = РасширениеКонфигурации();
	
	Если РасширениеКонфигурации <> Неопределено Тогда
		Возврат РасширениеКонфигурации.ХешСумма;
	КонецЕсли;
	
	Возврат ПолучитьДвоичныеДанныеИзСтроки("");
	
КонецФункции

Функция РасширениеКонфигурации() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	РасширениеКонфигурацииМассив = РасширенияКонфигурации.Получить(Новый Структура("Имя", Имя()));
	Если РасширениеКонфигурацииМассив.Количество() > 0 Тогда
		РасширениеКонфигурации = РасширениеКонфигурацииМассив[0];
		Возврат РасширениеКонфигурации;
	КонецЕсли;
КонецФункции

// Функция - Версия совместимости
// Возвращает номер текущей версии для работы мобильного приложения. 
// В мобильном приложении при авторизации сверяется Версия МП и версия совместимости.
//
// Возвращаемое значение:
//   Строка - версия для мобильного приложения
//
Функция ВерсияСовместимости() Экспорт
	Возврат "1.0.0.4";		
КонецФункции


// См. ОбновлениеИнформационнойБазыПереопределяемый.ПередОбновлениемИнформационнойБазы.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
		
	ИнтеграцияПодсистемБСП.ПослеОбновленияИнформационнойБазы(ПредыдущаяВерсия, ТекущаяВерсия,
		ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим);
		
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений.
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура:
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.ОбновлениеВерсииИБ
////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).
// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = Имя();
	Описание.Версия = Версия();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.
// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Выполняется всегда при обновлении версии конфигурации в пользовательском режиме.
	// Заполняет\обновляет операции и настройки модуля. Если версия ИБ пустая в регистре - первичное заполнение.
	// Иначе подтянет операции нужной версии.
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ОбщийОбработчик", "*");
	
	// Начальные обработчики заполнения.
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.СоздатьУзелОбменаЦентральнойБазы");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_РаботаСПользователямиСервер.СоздатьПользователяДляОбмена");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыОсновныхОбъектов");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыСхемСоединенияОбъектов");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыДополнительныхРеквизитов");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.СоздатьПредопределенныеЛицензииПодсистем");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "Справочники.вмс_МестаХранения.ЗарегистрироватьНаОбмен");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыПрограммныхМодулей");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыПравилаПоискаОбъектов");
	//3.2.5
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыИсточникиДанных");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыПравилаКонвертации");
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементыАлгоритмы");
	
	// Обработчики обновления. ПРИМЕР НИЖЕ
	// Работает так: Если нужно для какой то фичи добавить загрузку элементов в пользовательском режиме
	// 1. Повышаете версию конфигурации в корне
	// 2. Добавляете обработчик сюда, указываете версию, которую подняли.
	// вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.МетодОбновленияКакихТоДанных", "ВерсияНаКоторойНадоОбновиться");
	
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементы_ЗвуковаяСхема_Стандартная", "3.1.9", Истина);
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ЗагрузитьПредопределенныеЭлементы_ЗвуковаяСхема_Windows", "3.1.9", Истина);
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.УстановитьСтандартнуюЗвуковуюСхемуОператорам", "3.1.9", Истина);
	
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ОбновлениеИнформационнойБазыWMS.ОбновитьПравилаЗаполненияЗаданийКладовщику", "3.2.1", Ложь);
	
	//ТУ_Прошин_31.03.26+     
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_РаботаСТриграммамиВызовСервера.ЗаполнитьПервичноРегистрТриграммовФоновымЗаданием", "3.2.3", Истина);
	//ТУ_Прошин_31.03.26-
	
	//3.2.4 - Заполнение нового реквизита спр.МестаХранения.Штриход
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "Справочники.вмс_МестаХранения.ЗаполнитьРеквизитШтрихкод", "3.2.4", Ложь);
	//3.2.4 - Заполнение нового реквизита Вид контейнеров.
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "вмс_ПартионныйУчетСервер.НачальноеЗаполнениеВидовКонтейнеров", "3.2.4", Ложь);

	//3.2.5
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "Справочники.вмс_НастройкиОператора.НачальноеЗаполнениеМасштабаФормы", "3.2.5", Ложь);
	вмс_ОбновлениеИнформационнойБазы.ДобавитьОбработчикОбновления(Обработчики, "РегистрыСведений.вмс_ШтрихкодыРасширенный.ЗаполнитьКоэффициентыУпаковок", "3.2.5", Ложь);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

Функция ОбщийОбработчик() Экспорт
	
	ВерсияОт = вмс_ОбновлениеИнформационнойБазыСлужебный.ВерсияИБ(Имя());
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыНастроекПрограммы", "Справочник.вмс_НастройкиПрограммы", ВерсияОт);	
	//вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыОперацииТСД", , ВерсияОт);
	
	//3.2.4+
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыПравилЗаполненияЗадачиКладовщикуУТ", , ВерсияОт);
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоКА() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыПравилЗаполненияЗадачиКладовщикуУТ", , ВерсияОт);
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыПравилЗаполненияЗадачиКладовщикуУТ", , ВерсияОт);
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		//вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыПравилЗаполненияЗадачиКладовщикуУТ", , ВерсияОт);
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоБП() Тогда
		//вмс_ОбновлениеИнформационнойБазы.ЗагрузитьЭлементыИзМакета("ПредопределенныеЭлементыПравилЗаполненияЗадачиКладовщикуУТ", , ВерсияОт);
	Иначе
		ВызватьИсключение "Не найден макет правил заполнения заданий кладовщику под текущую конфигурацию!";
	КонецЕсли;
	
	
КонецФункции

Функция СоздатьУзелОбменаЦентральнойБазы() Экспорт

	Узел = ПланыОбмена.МобильныйОбмен.ЭтотУзел();
	
	Если НЕ ЗначениеЗаполнено(Узел.Код) Тогда
		обУзел = Узел.ПолучитьОбъект();
		обУзел.Код = "1";
		обУзел.Наименование = "ЦБ";
		обУзел.Записать();
	КонецЕсли;

КонецФункции

Функция ПолучитьОбъектыДляЗагрузкиПредопределенныхЭлементов() Экспорт

	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить("ПланВидовХарактеристик.вмс_СоответствиеМетаданных");
	МассивОбъектов.Добавить("ПланВидовХарактеристик.ТипыКонтейнеров");
	МассивОбъектов.Добавить("Справочник.вмс_НаборыДополнительныхРеквизитов");
	МассивОбъектов.Добавить("ПланВидовХарактеристик.вмс_ДополнительныеРеквизиты");
	МассивОбъектов.Добавить("Справочник.вмс_ЗначенияСвойствОбъектов");
	МассивОбъектов.Добавить("Справочник.вмс_ПравилаПоискаОбъектов");
	МассивОбъектов.Добавить("Справочник.вмс_НастройкиПрограммы");
	//МассивОбъектов.Добавить("Справочник.вмс_Операции");
	МассивОбъектов.Добавить("Справочник.вмс_СтатусыДокументов");
	МассивОбъектов.Добавить("Справочник.вмс_ЭтапыОперации");
	МассивОбъектов.Добавить("Справочник.ШаблоныЭтикеток_WMS");
	МассивОбъектов.Добавить("Справочник.вмс_СхемыСоединенияОбъектов");
	
	Возврат МассивОбъектов;

КонецФункции

Функция ПолучитьМакетПредопределенныхЭлементовОбъекта(Объект) Экспорт
			
	ИмяМакета = "ПредопределенныеЭлементы";		
	 
	МетаданныеОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьМетаданныеОбъекта(Объект);
	Если МетаданныеОбъекта.Макеты.Найти(ИмяМакета) <> Неопределено Тогда
		МенеджерОбъекта = вмс_ОбщегоНазначенияСервер.ПолучитьМенеджерОбъектовБазы(МетаданныеОбъекта);
		Макет = МенеджерОбъекта.ПолучитьМакет(ИмяМакета);
		Возврат Макет;
	КонецЕсли;
КонецФункции

Функция ЗагрузитьПредопределенныеЭлементыОсновныхОбъектов() Экспорт
			
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыОсновныхОбъектов");
		
КонецФункции

Функция ЗагрузитьПредопределенныеЭлементыСхемСоединенияОбъектов() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыСхемСоединенияОбъектов");
	
КонецФункции

Функция ЗагрузитьПредопределенныеЭлементыДополнительныхРеквизитов() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыДополнительныхРеквизитов");
	
КонецФункции

Функция ЗагрузитьПредопределенныеЭлементыПрограммныхМодулей() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыПрограммныхМодулей");
	
КонецФункции

//3.2.4+
Функция ЗагрузитьПредопределенныеЭлементыПравилаПоискаОбъектов() Экспорт
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыПравилаПоискаОбъектовУТКАЕРП");
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыПравилаПоискаОбъектовУНФ");
	ИначеЕсли вмс_АдаптацияКонфигураций.ЭтоБП() Тогда
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыПравилаПоискаОбъектовБП");
	Иначе
		вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыПравилаПоискаОбъектовБП");
	КонецЕсли;
	
КонецФункции

//3.2.5+
Функция ЗагрузитьПредопределенныеЭлементыИсточникиДанных() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыИсточникиДанных");
	
КонецФункции

//3.2.5+
Функция ЗагрузитьПредопределенныеЭлементыПравилаКонвертации() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыПравилаКонвертации");
	
КонецФункции

//3.2.5+
Функция ЗагрузитьПредопределенныеЭлементыАлгоритмы() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементыАлгоритмы");
	
КонецФункции


// ТУ_Кошелев 07.06.24 - Обновления функций, осветственных за создание запросов в СКД распоряжений операций
Функция СоздатьРаспоряжение(РаспоряжениеИмя, ПриставкаНаименования)   
	Наименование = Строка(Метаданные.НайтиПоПолномуИмени(РаспоряжениеИмя)) + ПриставкаНаименования; 
	
	НовоеРаспоряжение = Справочники.вмс_РаспоряженияОпераций.СоздатьЭлемент();
	НовоеРаспоряжение.Заполнить(Неопределено);
	НовоеРаспоряжение.РаспоряжениеКонфигуратор = РаспоряжениеИмя;
	НовоеРаспоряжение.Наименование = Наименование;
	НовоеРаспоряжение.Записать();   
	
	Возврат Наименование;
КонецФункции

Функция СоздатьПредопределенныеРаспоряжения_и_Операции() Экспорт     
	РК = вмс_РаботаСКоллекциями;
	
	// Очистка имеющихся элементов
	Выборка = Справочники.вмс_РаспоряженияОпераций.Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьОбъект().Удалить();
	КонецЦикла;   
	
	Распоряжения = вмс_АдаптацияКонфигураций.ПолучитьИменаРаспоряжений();  
	НаименованияРаспоряжений = Новый Структура("Поступление, Выбытие", Новый Массив, Новый Массив);     
	
	// Создание распоряжений
	Для Каждого РаспоряжениеТип Из Распоряжения Цикл
		Для Каждого РаспоряжениеИмя Из РаспоряжениеТип.Значение Цикл 
			Попытка
				Если РаспоряжениеТип.Ключ = "Гибрид" Тогда
					НаименованияРаспоряжений["Поступление"].Добавить(СоздатьРаспоряжение(РаспоряжениеИмя, " (Поступление)")); //По "Поступление/Выбытие" осуществляется поиск в дальнейнем, при изменении изменить в других местах где используется
					НаименованияРаспоряжений["Выбытие"].Добавить(СоздатьРаспоряжение(РаспоряжениеИмя, " (Выбытие)"));		  //Не делал реквизит, т.к. используется только для создания запросов при инициализации распоряжения
				Иначе                          
					НаименованияРаспоряжений[РаспоряжениеТип.Ключ].Добавить(СоздатьРаспоряжение(РаспоряжениеИмя, ""));
				КонецЕсли;	
			Исключение
				// Распоряжения нет в конфигурации, такое возможно для разных версий конфигурации
				ТекстОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("AS:WMS", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			КонецПопытки;	
		КонецЦикла;
	КонецЦикла;
	
	// Создание операций
	СоздатьОперацию("Приемка",				"Приемка",			   Ложь,   НаименованияРаспоряжений, "Поступление");
	СоздатьОперацию("Приемка в ячейки",		"ПриемкаВЯчейки",	   Ложь,   НаименованияРаспоряжений, "Поступление");
	СоздатьОперацию("Размещение",			"Размещение",		   Ложь,   НаименованияРаспоряжений, "Поступление");
	СоздатьОперацию("Отбор",				"Отбор",			   Ложь,   НаименованияРаспоряжений, "Выбытие");
	СоздатьОперацию("Отбор в контейнер",	"ОтборВКонтейнер",	   Ложь,   НаименованияРаспоряжений, "Выбытие");
	СоздатьОперацию("Контроль",				"Контроль",			   Ложь,   НаименованияРаспоряжений, "Выбытие");
	СоздатьОперацию("Отгрузка",				"Отгрузка",			   Истина, НаименованияРаспоряжений, "Выбытие");
	СоздатьОперацию("Присвоение штрихкода", "ПрисвоениеШтрихкода", Ложь,   Новый Массив); // ТУ_Кошелев 01.07.24 - добавил форму автономного присвоения штрихкода	
КонецФункции   

Процедура СоздатьОперацию(Наименование, ИмяДляПоиска, ОбработкаВФормеСписка, НаименованияРаспоряжений, ТипОперации = Неопределено)
	
	СсылкаНаОперацию = Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска", ИмяДляПоиска);
	Если ЗначениеЗаполнено(СсылкаНаОперацию) Тогда
		Операция = СсылкаНаОперацию.ПолучитьОбъект();
		Операция.Распоряжения.Очистить();
	Иначе
		Операция = Справочники.вмс_Операции.СоздатьЭлемент();
		Операция.Заполнить(Неопределено);
	КонецЕсли;
	
	Операция.Наименование = Наименование;
	Операция.ИмяДляПоиска = ИмяДляПоиска;                              
	Операция.ОбработкаВФормеСписка = ОбработкаВФормеСписка;
	Операция.ПоРаспоряжению = НаименованияРаспоряжений.Количество() > 0;  
	
	Если Операция.ПоРаспоряжению Тогда
		Для Каждого РаспоряжениеИмя Из НаименованияРаспоряжений[ТипОперации] Цикл
			Распоряжение = Операция.Распоряжения.Добавить();
			Распоряжение.СсылкаНаРаспоряжение = Справочники.вмс_РаспоряженияОпераций.НайтиПоНаименованию(РаспоряжениеИмя, Истина);
		КонецЦикла;
	КонецЕсли;
	
	Операция.Записать();
	
КонецПроцедуры

Функция СоздатьПредопределенныеЛицензииПодсистем() Экспорт
	ИменаВсехПодсистем = вмс_ОбщегоНазначенияКлиентСервер.ИменаВсехПодсистем();
	
	ПредопределенныеЭлементы = Новый ТаблицаЗначений;
	ПредопределенныеЭлементы.Колонки.Добавить("Подсистема", Новый ОписаниеТипов("Строка"), "Подсистема");
	ПредопределенныеЭлементы.Колонки.Добавить("Отображение", Новый ОписаниеТипов("Строка"), "Отображение");
	
	Для Индекс = 1 По ИменаВсехПодсистем.Имена.Количество() Цикл
		ПредопределенныеЭлементы.Добавить();
	КонецЦикла;  
	
	ПредопределенныеЭлементы.ЗагрузитьКолонку(ИменаВсехПодсистем.Имена, "Подсистема");
	ПредопределенныеЭлементы.ЗагрузитьКолонку(ИменаВсехПодсистем.Отображения, "Отображение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредопределенныеЭлементы.Подсистема КАК Подсистема,
	|	ПредопределенныеЭлементы.Отображение КАК Отображение
	|ПОМЕСТИТЬ Предпоределенные
	|ИЗ
	|	&ПредопределенныеЭлементы КАК ПредопределенныеЭлементы
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Предпоределенные.Подсистема КАК Подсистема,
	|	Предпоределенные.Отображение КАК Отображение
	|ИЗ
	|	Предпоределенные КАК Предпоределенные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_ЛицензииПодсистем КАК вмс_ЛицензииПодсистем
	|		ПО ((ВЫРАЗИТЬ(Предпоределенные.Подсистема КАК СТРОКА(100))) = вмс_ЛицензииПодсистем.Подсистема)
	|ГДЕ
	|	вмс_ЛицензииПодсистем.Подсистема ЕСТЬ NULL"; 
	Запрос.УстановитьПараметр("ПредопределенныеЭлементы", ПредопределенныеЭлементы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЛицензияПодсистем = РегистрыСведений.вмс_ЛицензииПодсистем.СоздатьМенеджерЗаписи();
		НоваяЛицензияПодсистем.Заполнить(Неопределено);
		НоваяЛицензияПодсистем.Подсистема  = Выборка.Подсистема;
		НоваяЛицензияПодсистем.Отображение = Выборка.Отображение; 
		НоваяЛицензияПодсистем.Лицензия    = "";
		НоваяЛицензияПодсистем.Записать(Ложь);
	КонецЦикла;
КонецФункции

Функция ЗагрузитьПредопределенныеЭлементы_ЗвуковаяСхема_Стандартная() Экспорт

	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементы_ЗвуковаяСхема_Стандартная");

КонецФункции

Функция ЗагрузитьПредопределенныеЭлементы_ЗвуковаяСхема_Windows() Экспорт

	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзОбщегоМакета("ПредопределенныеЭлементы_ЗвуковаяСхема_Windows");

КонецФункции

Функция УстановитьСтандартнуюЗвуковуюСхемуОператорам() Экспорт
	
	СтандартнаяЗвуковаяСхема = Справочники.вмс_Звуки.СтандартнаяСхема();
	
	Если ЗначениеЗаполнено(СтандартнаяЗвуковаяСхема) Тогда
		ВыборкаОператоров = Справочники.вмс_НастройкиОператора.Выбрать();
		Пока ВыборкаОператоров.Следующий() Цикл
			ОператорОбъект = ВыборкаОператоров.ПолучитьОбъект();
			Если НЕ ЗначениеЗаполнено(ОператорОбъект.ЗвуковаяСхема) Тогда
				ОператорОбъект.ЗвуковаяСхема = СтандартнаяЗвуковаяСхема;
				ОператорОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ОбновитьПравилаЗаполненияЗаданийКладовщику() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка КАК Правило,
	|	вмс_Операции.Ссылка КАК ОперацияПлана
	|ИЗ
	|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_Операции КАК вмс_Операции
	|		ПО вмс_ПравилаЗаполненияЗадачиКладовщику.Удалить_Товары_ОперацияПлана = вмс_Операции.Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПравилоОбъект = Выборка.Правило.ПолучитьОбъект();
		Если ПравилоОбъект.ПредыдущиеОперации.Количество() = 0 Тогда
			ЭлементПредыдущаяОперация = ПравилоОбъект.ПредыдущиеОперации.Добавить();
			ЭлементПредыдущаяОперация.ПредыдущаяОперация = ПравилоОбъект.Удалить_Товары_ОперацияПлана;
		КонецЕсли;
		ПравилоОбъект.Удалить_Товары_ОперацияПлана = Неопределено;
		ПравилоОбъект.Записать();
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка КАК Правило
	|ИЗ
	|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику.ПредыдущиеОперации КАК вмс_ПравилаЗаполненияЗадачиКладовщикуПредыдущиеОперации
	|		ПО вмс_ПравилаЗаполненияЗадачиКладовщику.Ссылка = вмс_ПравилаЗаполненияЗадачиКладовщикуПредыдущиеОперации.Ссылка
	|			И (1 = вмс_ПравилаЗаполненияЗадачиКладовщикуПредыдущиеОперации.НомерСтроки)
	|ГДЕ
	|	вмс_ПравилаЗаполненияЗадачиКладовщику.РежимФормированияЗаданий <> 1";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПравилоОбъект = Выборка.Правило.ПолучитьОбъект();
		ПравилоОбъект.РежимФормированияЗаданий = 1;
		ПравилоОбъект.Записать();
	КонецЦикла;
	
КонецФункции
